### Import Data CSV

In [147]:
import pandas as pd

# membaca dataset dan store ke dataframe
sample = pd.read_csv("sampledataok.csv")

# print
sample

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
0    Raditya Dika             L    34       Komedi     7000000
1  Statement Prod             L    29   Daily Vlog      120000
2  Arief Muhammad             L    28   Daily Vlog     3000000
3    Annisa Aziza             P    25  Food Travel      600000
4    Sarah Viloid             P    23        Gamer     2000000
5             MLI             L    30       Komedi      800000
6    Chandra Liow             L    26       Sketsa     3000000

### Macam-Macam Operasi

head()

In [148]:
# head(), menampilkan 5 records pertama
sample.head()

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
0    Raditya Dika             L    34       Komedi     7000000
1  Statement Prod             L    29   Daily Vlog      120000
2  Arief Muhammad             L    28   Daily Vlog     3000000
3    Annisa Aziza             P    25  Food Travel      600000
4    Sarah Viloid             P    23        Gamer     2000000

In [149]:
# menampilkan 2 records pertama
sample.head(2)

    nama_youtuber jenis_kelamin  umur    kategori  subscriber
0    Raditya Dika             L    34      Komedi     7000000
1  Statement Prod             L    29  Daily Vlog      120000

tail()

In [150]:
# head(), menampilkan 5 records terakhir
sample.tail()

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
2  Arief Muhammad             L    28   Daily Vlog     3000000
3    Annisa Aziza             P    25  Food Travel      600000
4    Sarah Viloid             P    23        Gamer     2000000
5             MLI             L    30       Komedi      800000
6    Chandra Liow             L    26       Sketsa     3000000

In [151]:
# menampilkan 3 records terakhir
sample.tail(3)

  nama_youtuber jenis_kelamin  umur kategori  subscriber
4  Sarah Viloid             P    23    Gamer     2000000
5           MLI             L    30   Komedi      800000
6  Chandra Liow             L    26   Sketsa     3000000

shape

In [152]:
# menampilkan jumlah baris dan kolom pada DataFrame
sample.shape

(7, 5)

Mean, Median, Standar Deviasi

In [153]:
# mean adalah rata-rata
# 2.785714e+01 artinya 2.285714 * 10^1 = 2.785714 * 10 jadi Mean-nya adalah 27.85714
# 2.360000e+06 artinya 2.360000 * 10^6 = 2.360000 * 1000000 jadi Mean-nya adalah 2360000
sample.mean()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1224\778165288.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.mean()

umur          2.785714e+01
subscriber    2.360000e+06
dtype: float64

In [154]:
# median adalah nilai tengah dari data yang telah diurut dari terkecil hingga terbesar
# umur : 23 25 26 28 29 30 34
sample.median()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1224\2166340932.py:3: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.median()

umur               28.0
subscriber    2000000.0
dtype: float64

In [155]:
# standar deviasi
sample.std()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1224\4082167482.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.std()

umur          3.625308e+00
subscriber    2.346174e+06
dtype: float64

Max, Min, Count

In [156]:
# max untuk mencari nilai tertinggi
sample.max()

nama_youtuber    Statement Prod
jenis_kelamin                 P
umur                         34
kategori                 Sketsa
subscriber              7000000
dtype: object

In [157]:
# min untuk mencari nilai terendah
sample.min()

nama_youtuber    Annisa Aziza
jenis_kelamin               L
umur                       23
kategori           Daily Vlog
subscriber             120000
dtype: object

In [158]:
# jumlah non null record pada setiap kolom
sample.count()

nama_youtuber    7
jenis_kelamin    7
umur             7
kategori         7
subscriber       7
dtype: int64

describe()

In [159]:
# ringaksan statistik data
sample.describe()

            umur    subscriber
count   7.000000  7.000000e+00
mean   27.857143  2.360000e+06
std     3.625308  2.346174e+06
min    23.000000  1.200000e+05
25%    25.500000  7.000000e+05
50%    28.000000  2.000000e+06
75%    29.500000  3.000000e+06
max    34.000000  7.000000e+06

iloc

In [160]:
# menampikan record 1 kolom (umur yang berada di indeks ke-2)
sample.iloc[:,2]

0    34
1    29
2    28
3    25
4    23
5    30
6    26
Name: umur, dtype: int64

In [161]:
# menampilkan 3 record pertama dari 1 kolom (umur)
sample.iloc[0:3,2]

0    34
1    29
2    28
Name: umur, dtype: int64

In [162]:
# menampilkan kembali semua baris dan kolom
sample.iloc[:,:]

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
0    Raditya Dika             L    34       Komedi     7000000
1  Statement Prod             L    29   Daily Vlog      120000
2  Arief Muhammad             L    28   Daily Vlog     3000000
3    Annisa Aziza             P    25  Food Travel      600000
4    Sarah Viloid             P    23        Gamer     2000000
5             MLI             L    30       Komedi      800000
6    Chandra Liow             L    26       Sketsa     3000000

loc

In [163]:
# menampilkan record 1 kolom, dengan menulis nama kolomnya("nama_youtuber")
sample.loc[:,"nama_youtuber"]

0      Raditya Dika
1    Statement Prod
2    Arief Muhammad
3      Annisa Aziza
4      Sarah Viloid
5               MLI
6      Chandra Liow
Name: nama_youtuber, dtype: object

In [164]:
# menampilkan record dari indeks ke-0 sammpai ke-3 dari kolom "nama_youtuber"
sample.loc[0:3,"nama_youtuber"]

0      Raditya Dika
1    Statement Prod
2    Arief Muhammad
3      Annisa Aziza
Name: nama_youtuber, dtype: object

In [165]:
# menammpilkan kembali semua baris dan kolom
sample.loc[:3,"nama_youtuber":"jenis_kelamin"]

    nama_youtuber jenis_kelamin
0    Raditya Dika             L
1  Statement Prod             L
2  Arief Muhammad             L
3    Annisa Aziza             P

Mengisi Nilai Sama Untuk 1 Kolom

In [166]:
# mengisi nilai 1 untuk kolom "subscriber"
sample['subscriber']=1
sample

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
0    Raditya Dika             L    34       Komedi           1
1  Statement Prod             L    29   Daily Vlog           1
2  Arief Muhammad             L    28   Daily Vlog           1
3    Annisa Aziza             P    25  Food Travel           1
4    Sarah Viloid             P    23        Gamer           1
5             MLI             L    30       Komedi           1
6    Chandra Liow             L    26       Sketsa           1

Sorting

In [167]:
# sorting berdasarkan ascending dari kolom "kategori"
sample.sort_values(by='kategori')

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
1  Statement Prod             L    29   Daily Vlog           1
2  Arief Muhammad             L    28   Daily Vlog           1
3    Annisa Aziza             P    25  Food Travel           1
4    Sarah Viloid             P    23        Gamer           1
0    Raditya Dika             L    34       Komedi           1
5             MLI             L    30       Komedi           1
6    Chandra Liow             L    26       Sketsa           1

In [168]:
# sorting berdasarkan descending dari kolom "kategori"
sample.sort_values(by='kategori', ascending=False)

    nama_youtuber jenis_kelamin  umur     kategori  subscriber
6    Chandra Liow             L    26       Sketsa           1
0    Raditya Dika             L    34       Komedi           1
5             MLI             L    30       Komedi           1
4    Sarah Viloid             P    23        Gamer           1
3    Annisa Aziza             P    25  Food Travel           1
1  Statement Prod             L    29   Daily Vlog           1
2  Arief Muhammad             L    28   Daily Vlog           1

Filter

In [169]:
# filter record yang "umurnya" lebih dari 28 dan akan menampilkan status True atau False
sample['umur'] > 28

0     True
1     True
2    False
3    False
4    False
5     True
6    False
Name: umur, dtype: bool

In [170]:
# filter, kemudian tampilkan record-nya
filter1 = sample['umur'] > 28
filterbaru = sample[filter1]
filterbaru

    nama_youtuber jenis_kelamin  umur    kategori  subscriber
0    Raditya Dika             L    34      Komedi           1
1  Statement Prod             L    29  Daily Vlog           1
5             MLI             L    30      Komedi           1

In [171]:
# filter dengan 2 parameter (berdasarkan yang umurnya 27 dan kategori Daily Vlog)
filter2 = (sample['umur'] > 27) & (sample['kategori'] == 'Daily Vlog')
filterbaru = sample[filter2]
filterbaru

    nama_youtuber jenis_kelamin  umur    kategori  subscriber
1  Statement Prod             L    29  Daily Vlog           1
2  Arief Muhammad             L    28  Daily Vlog           1

Rename dan Drop Kolom

In [172]:
# rename kolom
sample = sample.rename(columns={'nama_youtuber':'Youtuber'})
sample

         Youtuber jenis_kelamin  umur     kategori  subscriber
0    Raditya Dika             L    34       Komedi           1
1  Statement Prod             L    29   Daily Vlog           1
2  Arief Muhammad             L    28   Daily Vlog           1
3    Annisa Aziza             P    25  Food Travel           1
4    Sarah Viloid             P    23        Gamer           1
5             MLI             L    30       Komedi           1
6    Chandra Liow             L    26       Sketsa           1

In [173]:
# drop atau menghilangkan kolom
sample = sample.drop(columns=['jenis_kelamin'])
sample

         Youtuber  umur     kategori  subscriber
0    Raditya Dika    34       Komedi           1
1  Statement Prod    29   Daily Vlog           1
2  Arief Muhammad    28   Daily Vlog           1
3    Annisa Aziza    25  Food Travel           1
4    Sarah Viloid    23        Gamer           1
5             MLI    30       Komedi           1
6    Chandra Liow    26       Sketsa           1